app/views/shopping_bags/checkout.html.erb


 <% current_bag.shopping_items.each do |item| %>
---
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."shopping_bag_id" = ?  [["shopping_bag_id", 34]]