app/views/shopping_bags/index.html.erb

SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."shopping_bag_id" = ?  [["shopping_bag_id", 33]]
---
 <% if current_bag.total_price != 0 %>
 <% current_bag.shopping_items.each do |item| %>