app/views/dreamtypes/_dreamtype.html.erb

	<p>
		<% dreamtype.products.each do |dream| %>
---
SELECT "products".* FROM "products" WHERE "products"."dreamtype_id" = ?  [["dreamtype_id", 1]]