app/views/customers/outstanding.html.erb

<h3>Order Number: <%= order.id %></h3>
<% order.order_details.each do |details| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 7]]