app/views/carts/index.html.erb


 <% current_cart.cart_items.each do |item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]