app/controllers/application_controller.rb

  def set_bag
    @bag =  ShoppingBag.find(session[:cart_id])
    rescue ActiveRecord::RecordNotFound
    @bag = ShoppingBag.create
---
SELECT "shopping_bags".* FROM "shopping_bags" WHERE "shopping_bags"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-11-17 02:06:16.967602"], ["updated_at", "2019-11-17 02:06:16.967602"]]
INSERT INTO "shopping_bags" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-11-22 22:52:38.968275"], ["updated_at", "2019-11-22 22:52:38.968275"]]

   def current_bag
      if !session[:cart_id].nil?
        ShoppingBag.find(session[:cart_id])
---
SELECT "shopping_bags".* FROM "shopping_bags" WHERE "shopping_bags"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]