app/controllers/application_controller.rb

  def set_cart
    @cart = Cart.find(session[:cart_id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]