app/controllers/cart_items_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_cart
      @current_cart = Cart.find(session[:cart_id])