app/controllers/cart_items_controller.rb

INSERT INTO "cart_items" ("products_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["products_id", 1], ["cart_id", 1], ["created_at", "2019-11-17 17:11:28.612336"], ["updated_at", "2019-11-17 17:11:28.612336"], ["quantity", 1]]
---
  def create
    new_item = CartItem.new(products_id: params[:product][:products_id],
                                  quantity: params[:product][:quantity],
                                  cart_id: current_cart.id)

    new_item.save!

UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2019-11-17 18:13:06.940579"], ["id", 9]]
---
  def update
    if @cart_item.update(cart_item_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def destroy
    @cart_item.destroy

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_cart
      @current_cart = Cart.find(session[:cart_id])

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cart_item
      @cart_item = CartItem.find(params[:id])