app/controllers/customers_controller.rb

def outstanding

	@customer = Customer.where(id: session[:customer_id]).first

	@orders = Order.where(customers_id: session[:customer_id], fulfilled: false)
---
SELECT "orders".* FROM "orders" WHERE "orders"."customers_id" = ? AND "orders"."fulfilled" = ?  [["customers_id", 2], ["fulfilled", 0]]