app/controllers/customers_controller.rb

	def register
		@codes = Province.pluck(:code)

		if params.include?(:first_name)
			province_id = Province.where(code: params[:province]).pluck(:id).first

			@customer = Customer.create(first_name: params[:first_name],
				last_name: params[:last_name],
				address: params[:address],
				postal_code: params[:postal_code],
				email: params[:email],
				phone: params[:phone],
				card_number: params[:card_number],
				password: params[:password],
				Province_id: province_id)

			@customer.personal_photo.attach(params[:personal_photo])

			@customer.save
			@errors = @customer.errors.full_messages

			if @customer.valid?
				session[:customer_id] = @customer.id
			#this will be change to username
			session[:customer_name] = @customer.first_name
---
SELECT "provinces"."code" FROM "provinces"
SELECT "provinces"."id" FROM "provinces" WHERE "provinces"."code" = ?  [["code", "QC"]]
INSERT INTO "customers" ("first_name", "last_name", "address", "postal_code", "email", "card_number", "password", "provinces_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "customers" SET "updated_at" = ? WHERE "customers"."id" = ?  [["updated_at", "2019-11-27 04:01:28.730009"], ["id", 12]]
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]

def login
	if params.include?(:email)
		@customer = Customer.where(email: params[:email], password: params[:password]).first
		if @customer
			session[:customer_id] = @customer.id
			#this will be change to username
			session[:customer_name] = @customer.first_name
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? AND "customers"."password" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["email", "churzed@gmail.com"], ["password", "password"], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]

def outstanding

	@customer = Customer.where(id: session[:customer_id]).first

	@orders = Order.where(customer_id: session[:customer_id], fulfilled: false)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ? AND "orders"."fulfilled" = ?  [["customer_id", 1], ["fulfilled", 0]]