app/controllers/dreamtypes_controller.rb

  def index
  	@dreamtypes = Dreamtype.all.page params[:page]
---
SELECT "dreamtypes".* FROM "dreamtypes" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def show
  	@dreamtype = Dreamtype.find(params[:id])
---
SELECT "dreamtypes".* FROM "dreamtypes" WHERE "dreamtypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]