app/controllers/pages_controller.rb

SELECT "pages"."about" FROM "pages"
---
  def about
  	@about = Page.all

SELECT "pages"."contact" FROM "pages"
---
  def contact
  	@contact = Page.select(:contact)