app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%%' OR Products.description LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" WHERE (updated_at > '2019-11-15 01:57:53.255273') LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT "products".* FROM "products" INNER JOIN "dreamtypes" ON "dreamtypes"."id" = "products"."dreamtype_id" WHERE (dreamtype = 'ComfortingDream' AND name LIKE '%%' OR products.description LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" INNER JOIN "dreamtypes" ON "dreamtypes"."id" = "products"."dreamtype_id" WHERE (dreamtype = 'ComfortingDream' AND name LIKE '%%' OR Products.description LIKE '%%')
SELECT "dreamtypes"."dreamtype" FROM "dreamtypes"
---
	def index
		if params[:search]
			if (params[:search] == "")
				@products = Product.order(:name).page params[:page]
			end
			if (params[:category] == "")
				@products = Product.where("name LIKE ? OR Products.description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%").page params[:page]
			end
			if (params[:category] == "AbsurdDream")
				@products = Product.joins(:dreamtype).where("dreamtype = 'AbsurdDream' AND name LIKE ? OR products.description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%").page params[:page]
			end
			if (params[:category] == "ComfortingDream")
				@products = Product.joins(:dreamtype).where("dreamtype = 'ComfortingDream' AND name LIKE ? OR products.description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%").page params[:page]
			end
		elsif params[:datefilter]
			if (params[:datefilter] == "Recently Updated")
				@products = Product.where('updated_at > ?', 2.days.ago).page params[:page]
			end
			if (params[:datefilter] == "Recently Created")
				@products = Product.where('created_at > ?', 2.days.ago).page params[:page]
			end
		else
			@products = Product.order(:name).page params[:page]
		end

		@dreamtypes = Dreamtype.pluck(:dreamtype)