app/controllers/shopping_items_controller.rb

  def update
    if @shopping_item.update(shopping_item_params)
---
UPDATE "shopping_items" SET "quantity" = ?, "updated_at" = ? WHERE "shopping_items"."id" = ?  [["quantity", 1], ["updated_at", "2019-11-19 22:38:20.207155"], ["id", 1]]

  def destroy
    @shopping_item.destroy
---
DELETE FROM "shopping_items" WHERE "shopping_items"."id" = ?  [["id", 22]]

    def current_bag
      @current_bag = ShoppingBag.find(session[:shopping_bag_id])
---
SELECT "shopping_bags".* FROM "shopping_bags" WHERE "shopping_bags"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]

    def set_shopping_item
      @shopping_item = ShoppingItem.find(params[:id])
---
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]