app/controllers/shopping_bags_controller.rb

	def checkout
		@customer = Customer.where(id: session[:customer_id]).first

		@taxes = @customer.Province.gst + @customer.Province.pst + @customer.Province.hst
		@total_cost = (current_bag.total_price * @taxes) + current_bag.total_price

		if params[:tax_total]
			@order = Order.create(order_date: Date.today, pst: @customer.Province.pst,
				gst: @customer.Province.gst, hst: @customer.Province.hst, Customer_id: @customer.id,
				total: @total_cost,
				fulfilled: false)

			@order.save

			current_bag.shopping_items.each do |item|

				@total_cost = item.product.price_per_unit * item.quantity

				@order_detail = OrderDetail.create(
					quantity: item.quantity, discount: item.product.discount,
					product_price: item.product.price_per_unit,
					order_id: @order.id, product_id: item.product.id,
					total: @total_cost)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("order_date", "pst", "Customer_id", "created_at", "updated_at", "gst", "hst") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_date", "2019-11-23"], ["pst", 0.07], ["Customer_id", 1], ["created_at", "2019-11-23 23:22:19.958077"], ["updated_at", "2019-11-23 23:22:19.958077"], ["gst", 0.05], ["hst", 0.0]]
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."shopping_bag_id" = ?  [["shopping_bag_id", 34]]
INSERT INTO "order_details" ("quantity", "total", "product_price", "order_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 4], ["total", 42.0], ["product_price", 10.5], ["order_id", 7], ["product_id", 1], ["created_at", "2019-11-23 23:46:44.118914"], ["updated_at", "2019-11-23 23:46:44.118914"]]