app/models/cart.rb

UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 5], ["updated_at", "2019-11-17 17:17:14.428585"], ["id", 1]]
INSERT INTO "cart_items" ("products_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["products_id", 2], ["cart_id", 1], ["created_at", "2019-11-17 17:17:28.946275"], ["updated_at", "2019-11-17 17:17:28.946275"], ["quantity", 5]]
---
  def add_product(product_params)
    current_item = cart_items.find_by(products_id: product_params[:product][:products_id])

    if current_item
      current_item.quantity += product_params[:product][:quantity].to_i
      current_item.save
    else
      new_item = cart_items.create(products_id: product_params[:product][:products_id],
                                  quantity: product_params[:product][:quantity],
                                  cart_id: self.id)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
---
  def cart_size
    size = 0
    self.cart_items.each do |cart_item|

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def total_price
    cart_items.to_a.sum { |item| item.product.price_per_unit * item.quantity }