app/models/shopping_bag.rb

  def add_product(product_params)
    current_item = shopping_items.find_by(products_id: product_params[:product][:products_id])

    if current_item
      current_item.quantity += product_params[:product][:quantity].to_i
      current_item.save
    else
      new_item = shopping_items.create(products_id: product_params[:product][:products_id],
                                  quantity: product_params[:product][:quantity],
                                  shopping_bag_id: self.id)
---
INSERT INTO "shopping_items" ("products_id", "shopping_bag_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["products_id", 1], ["shopping_bag_id", 8], ["created_at", "2019-11-18 15:28:04.926046"], ["updated_at", "2019-11-18 15:28:04.926046"], ["quantity", 1]]

  def bag_size
    size = 0
    self.shopping_items.each do |item|
---
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."shopping_bag_id" = ?  [["shopping_bag_id", 1]]

  def total_price
    shopping_items.to_a.sum { |item| item.product.price_per_unit * item.quantity }
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]